app/controllers/clocks_controller.rb

SELECT "clocks".* FROM "clocks"
---
  def index
    @clocks = Clock.all
    Time.zone = 'Melbourne'
    @defaultTime =  Time.zone

    #work out difference in days
    @clocks.each do |clock|

INSERT INTO "clocks" ("city", "created_at", "updated_at", "timezone") VALUES ($1, $2, $3, $4) RETURNING "id"  [["city", "GMT+12"], ["created_at", "2020-06-12 08:28:10.098090"], ["updated_at", "2020-06-12 08:28:10.098090"], ["timezone", "Etc/GMT+12"]]
---
  def create

    #find time zone for city
    params[:clock][:timezone] = find_timezone(params[:clock][:city])

    @clock = Clock.new(clock_params)

    respond_to do |format|
      if(params[:clock][:timezone] == nil)
        format.html { redirect_to new_clock_path, notice: 'Invalid Name'}
      elsif @clock.save

DELETE FROM "clocks" WHERE "clocks"."id" = $1  [["id", 2]]
---
  def destroy
    @clock.destroy

SELECT "cities".* FROM "cities" WHERE "cities"."name" = $1  [["name", "melbourne"]]
---
  def find_timezone(city)
    @cities = City.all
    cityObject = @cities.where(name: city.downcase)

SELECT  "clocks".* FROM "clocks" WHERE "clocks"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
    def set_clock
      @clock = Clock.find(params[:id])